#+macro: module-summary (eval (org-export-string-as (concat "- [[file:" $1 ".org][" $1 "]] :: \n  #+include: " $1 ".org::module-summary\n") 'org t))
#+EXPORT_FILE_NAME: README.org

#+title: zzamboni's Elvish libraries
#+author: Diego Zamboni
#+email: diego@zzamboni.org

This Elvish package contains various modules I have written for the [[https://elv.sh/][Elvish shell]]. [[https://github.com/zzamboni/elvish-themes/][Themes]] and [[https://github.com/zzamboni/elvish-completions][completions]] are kept in separate packages.

* Compatibility

These modules are only guaranteed to be fully compatible with [[https://elv.sh/get/][Elvish HEAD]], which is what I use. This means that occasionally, they will not work even with the latest official release, when breaking changes are introduced. Since Elvish is in active development, I highly recommend you use the latest commit too.

* Installation

To install, use [[https://elvish.io/ref/epm.html][epm]]:

#+begin_src elvish
  use epm
  epm:install github.com/zzamboni/elvish-modules
#+end_src

For each module you want to use, you need to add the following to your =rc.elv= file:

#+begin_src elvish
  use github.com/zzamboni/elvish-modules/<modulename>
#+end_src

See each module's page for detailed usage instructions.

* Modules

The following modules are included:

#+begin_src elvish :exports results :results drawer :eval no-export
echo "" # blank lines prevents github rendering error in which the first item is now shown
ls *.org | egrep -v 'README|_template' | each [m]{ echo "{{{module-summary("(basename $m .org)")}}}" }
#+end_src

#+RESULTS:
:results:

{{{module-summary(1pass)}}}
{{{module-summary(alias)}}}
{{{module-summary(atlas)}}}
{{{module-summary(bang-bang)}}}
{{{module-summary(dir)}}}
{{{module-summary(git-vcsh)}}}
{{{module-summary(iterm2)}}}
{{{module-summary(lazy-vars)}}}
{{{module-summary(leanpub)}}}
{{{module-summary(long-running-notifications)}}}
{{{module-summary(nix)}}}
{{{module-summary(opsgenie)}}}
{{{module-summary(prompt-hooks)}}}
{{{module-summary(proxy)}}}
{{{module-summary(semver)}}}
{{{module-summary(spinners)}}}
{{{module-summary(terminal-title)}}}
{{{module-summary(test)}}}
{{{module-summary(tinytex)}}}
{{{module-summary(tty)}}}
{{{module-summary(util)}}}
:end:
